iysheng/rt-thread/bsp/gd32/gd32205/drivers/drv_can.c
    return RT_EOK;
}

static int _can_sendmsg(struct rt_can_device *can, const void *buf, rt_uint32_t box_num)
{
    uint32_t hcan;
    hcan = ((struct gd32_can *)(can->parent.user_data))->CanHandle;
    struct rt_can_msg *pmsg = (struct rt_can_msg *) buf;
    can_trasnmit_message_struct txheader = {0};
    /* Check the parameters */
    RT_ASSERT(pmsg->len <= 0x08);

    if (RT_CAN_STDID == pmsg->ide)
    {
        txheader.tx_ff = CAN_ID_STD;
        RT_ASSERT(IS_CAN_STDID(pmsg->id));
        txheader.tx_sfid = pmsg->id;
    }
    else
    {
        txheader.tx_ff = CAN_ID_EXT;
        RT_ASSERT(IS_CAN_EXTID(pmsg->id));
        txheader.tx_efid = pmsg->id;
    }

    if (RT_CAN_DTR == pmsg->rtr)
    {
        txheader.tx_ft = CAN_RTR_DATA;
    }
    else
    {
        txheader.tx_ft = CAN_RTR_REMOTE;
    }
    txheader.tx_dlen = pmsg->len;
    rt_memcpy(txheader.tx_data, pmsg->data, txheader.tx_dlen);
    if (box_num == can_message_transmit_with_boxnum(hcan, &txheader, box_num))
    {
        return RT_EOK;
    }
    else
    {
        return RT_ERROR;
    }
}

static int _can_recvmsg(struct rt_can_device *can, void *buf, rt_uint32_t fifo)
{
    uint8_t len;
    uint32_t hcan;
    struct rt_can_msg *pmsg;

    can_receive_message_struct rxmsg = {0};
    RT_ASSERT(can);

    hcan = ((struct gd32_can *)can->parent.user_data)->CanHandle;
    pmsg = (struct rt_can_msg *) buf;

    /* get data */
    can_message_receive(hcan, fifo, &rxmsg);
    if (rxmsg.rx_dlen == 0)
        return -RT_ERROR;
    /* get id */
    if (CAN_ID_STD == rxmsg.rx_ff)
    {
        pmsg->ide = RT_CAN_STDID;
        pmsg->id = rxmsg.rx_sfid;
    }
    else
    {
        pmsg->ide = RT_CAN_EXTID;
        pmsg->id = rxmsg.rx_efid;
    }
    /* get type */
    if (CAN_RTR_DATA == rxmsg.rx_ft)
    {
        pmsg->rtr = RT_CAN_DTR;
    }
    else
    {
        pmsg->rtr = RT_CAN_RTR;
    }
    /* get len */
    pmsg->len = rxmsg.rx_dlen;
    rt_memcpy(pmsg->data, rxmsg.rx_data, rxmsg.rx_dlen);
    /* get hdr */
    if (hcan == CAN0)
    {
        pmsg->hdr = (rxmsg.rx_fi + 1) >> 1;
    }
#ifdef BSP_USING_CAN1
    else if (hcan == CAN1)
    {
       //pmsg->hdr = (rxmsg.FI>> 1) + 14;
    }
#endif

    return RT_EOK;
}


static const struct rt_can_ops _can_ops =
{
    _can_config,
    _can_control,
    _can_sendmsg,
    _can_recvmsg,
};

extern void mark_catch_command(uint8_t status);
static void _can_rx_isr(struct rt_can_device *can, rt_uint32_t fifo)
{
    uint32_t hcan;
    RT_ASSERT(can);
    hcan = ((struct gd32_can *) can->parent.user_data)->CanHandle;

    //LOG_E("Wow can rx isr");
    switch (fifo)
    {
    case CAN_RX_FIFO0:
        /* Check Overrun flag for FIFO0 */
        if (SET == can_interrupt_flag_get(hcan, CAN_INT_FLAG_RFO0))
        {
            /* Clear FIFO0 Overrun Flag */
            can_flag_clear(hcan, CAN_FLAG_RFO0);
            rt_hw_can_isr(can, RT_CAN_EVENT_RXOF_IND | fifo << 8);
        }

        /* save to user list */
        if (can_receive_message_length_get(hcan, CAN_FIFO0))
        {
            rt_hw_can_isr(can, RT_CAN_EVENT_RX_IND | fifo << 8);
            mark_catch_command(1);
        }

        /* Check FULL flag for FIFO0 */
        if (SET == can_interrupt_flag_get(hcan, CAN_INT_FLAG_RFF0))
        {
            /* Clear FIFO0 Overrun Flag */
            can_flag_clear(hcan, CAN_FLAG_RFF0);
            rt_hw_can_isr(can, RT_CAN_EVENT_RXOF_IND| fifo << 8);
        }
        break;
    case CAN_RX_FIFO1:
        /* Check Overrun flag for FIFO1 */
        if (SET == can_interrupt_flag_get(hcan, CAN_INT_FLAG_RFO1))
        {
            /* Clear FIFO1 Overrun Flag */
            can_flag_clear(hcan, CAN_FLAG_RFO1);
            rt_hw_can_isr(can, RT_CAN_EVENT_RXOF_IND | fifo << 8);
        }

        /* save to user list */
        if (can_receive_message_length_get(hcan, CAN_FIFO1))
        {
            rt_hw_can_isr(can, RT_CAN_EVENT_RX_IND | fifo << 8);
            mark_catch_command(1);
        }

        /* Check FULL flag for FIFO1 */
        if (SET == can_interrupt_flag_get(hcan, CAN_INT_FLAG_RFF1))
        {
            /* Clear FIFO1 Overrun Flag */
            can_flag_clear(hcan, CAN_FLAG_RFF1);
            rt_hw_can_isr(can, RT_CAN_EVENT_RXOF_IND| fifo << 8);
        }
        break;
    }
    //rt_kprintf("can isr 1111111111111111111\n");
}

#ifdef BSP_USING_CAN0
/**
 * @brief This function handles CAN1 TX interrupts. transmit fifo0/1/2 is empty can trigger this interrupt
 */
void USBD_HP_CAN0_TX_IRQHandler(void)
{
    rt_interrupt_enter();
    uint32_t hcan;
    hcan = drv_can0.CanHandle;

    if (SET == can_flag_get(hcan, CAN_FLAG_MTF0))
    {
        rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_DONE | 0 << 8);
        can_flag_clear(hcan, CAN_FLAG_MTF0);
    }
    else if (SET == can_flag_get(hcan, CAN_FLAG_MTF1))
    {
        rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_DONE | 1 << 8);
        can_flag_clear(hcan, CAN_FLAG_MTF1);
    }
    else if (SET == can_flag_get(hcan, CAN_FLAG_MTF2))
    {
        rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_DONE | 2 << 8);
        can_flag_clear(hcan, CAN_FLAG_MTF2);
    }
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN1 RX0 interrupts.
 */
void USBD_LP_CAN0_RX0_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_rx_isr(&drv_can0.device, CAN_RX_FIFO0);
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN1 RX1 interrupts.
 */
void CAN0_RX1_IRQHandler(void)
{
    rt_interrupt_enter();
    _can_rx_isr(&drv_can0.device, CAN_RX_FIFO1);
    rt_interrupt_leave();
}

/**
 * @brief This function handles CAN0 EWMC interrupts.
 */
void CAN0_EWMC_IRQHandler(void)
{
    rt_uint32_t errtype;
    uint32_t hcan;

    hcan = drv_can0.CanHandle;
    errtype = can_error_get(hcan);

	rt_kprintf("err--------, errtype=%x\n", errtype);
    rt_interrupt_enter();
#if 0
    HAL_CAN_IRQHandler(hcan);

    switch ((errtype & 0x70) >> 4)
    {
    case RT_CAN_BUS_BIT_PAD_ERR:
        drv_can0.device.status.bitpaderrcnt++;
        break;
    case RT_CAN_BUS_FORMAT_ERR:
        drv_can0.device.status.formaterrcnt++;
        break;
    case RT_CAN_BUS_ACK_ERR:/* attention !!! test ack err's unit is transmit unit */
        drv_can0.device.status.ackerrcnt++;
        if (!READ_BIT(drv_can0.CanHandle->TSTR, CAN_FLAG_TXOK0))
            rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_FAIL | 0 << 8);
        else if (!READ_BIT(drv_can0.CanHandle->TSTR, CAN_FLAG_TXOK1))
            rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_FAIL | 1 << 8);
        else if (!READ_BIT(drv_can0.CanHandle->TSTR, CAN_FLAG_TXOK2))
            rt_hw_can_isr(&drv_can0.device, RT_CAN_EVENT_TX_FAIL | 2 << 8);
        break;
    case RT_CAN_BUS_IMPLICIT_BIT_ERR:
    case RT_CAN_BUS_EXPLICIT_BIT_ERR:
        drv_can0.device.status.biterrcnt++;
        break;
    case RT_CAN_BUS_CRC_ERR:
        drv_can0.device.status.crcerrcnt++;
        break;
    }

    drv_can0.device.status.lasterrtype = errtype & 0x70;
    drv_can0.device.status.rcverrcnt = errtype >> 24;
    drv_can0.device.status.snderrcnt = (errtype >> 16 & 0xFF);
    drv_can0.device.status.errcode = errtype & 0x07;
#endif

    can_flag_clear(hcan, CAN_FLAG_WERR);
    can_flag_clear(hcan, CAN_FLAG_PERR);
    can_flag_clear(hcan, CAN_FLAG_BOERR);
    rt_interrupt_leave();
}
#endif /* BSP_USING_CAN0 */

